{"title":"Pre Combine Mock Draft 2026","date":"2026-03-05","author":"SAKFootball","rounds":1,"picks":[{"pick":1,"team":"Las Vegas Raiders","player":"Fernando Mendoza","position":"QB","school":"Indiana","height":"6'5\"","weight":"225","notes":"Fernando is by far the most polished quarterback in this class. The Raiders need a franchise quarterback and Mendoza is their guy."},{"pick":2,"team":"New York Jets","player":"Caleb Downs","position":"S","school":"Ohio State","height":"6'0\"","weight":"205","notes":"The Jets have taken safeties high in the draft before and they strike again with Downs. He has been one of the best defenders in the country since he was a freshman playing for Nick Saban at Alabama. He's best playing in the box and is a tremendous leader and culture setter for a franchise."},{"pick":3,"team":"Arizona Cardinals","player":"Jeremiyah Love","position":"RB","school":"Notre Dame","height":"6'0\"","weight":"214","notes":"Love is a super talented back that has great receiving upside as well. He can be a weapon out of the slot and provides a huge boost over an aging James Conner and Trey Benson. Insanely fast and can score on any play."},{"pick":4,"team":"Tennessee Titans","player":"Rueben Bain Jr.","position":"DL","school":"Miami","height":"6'3\"","weight":"275","notes":"Newly signed head coach Robert Salah chooses to upgrade the defense with Rueben Bain. He has inside-outside versatility and can create havoc on every down. Every down defender who can become a superstar."},{"pick":5,"team":"New York Giants","player":"Sonny Styles","position":"LB","school":"Ohio State","height":"6'4\"","weight":"243","notes":"Sonny Styles is one of my favorite players in this class. He is a former safety who is now one of the best tacklers in the nation. He had one missed tackle all season and has the potential to be one of the best players in the league."},{"pick":6,"team":"Cleveland Browns","player":"Jordyn Tyson","position":"WR","school":"Arizona State","height":"6'2\"","weight":"200","notes":"The Browns make it two receivers in a row with Tyson out of Arizona State. For me, Tyson has the highest ceiling and will instantly help Shedeur elevate the offense. He is electrifying after the catch and makes spectacular catches weekly. He can score every play."},{"pick":7,"team":"Washington Commanders","player":"David Bailey","position":"DL","school":"Texas Tech","height":"6'3\"","weight":"250","notes":"David Bailey has gotten a lot of hype as the offseason has gone on. He was tied for the lead in sacks this season and has insane burst off the edge. He can win very quickly however his size makes you question what kind of run defender he will be. Has high potential."},{"pick":8,"team":"New Orleans Saints","player":"Carnell Tate","position":"WR","school":"Ohio State","height":"6'3\"","weight":"195","notes":"Tate has the highest floor out of all the receivers in this class for me. He can run every route, wins contested catches and has over the top capabilities. He can be the next great Ohio State receiver."},{"pick":9,"team":"Kansas City Chiefs","player":"Jermod McCoy","position":"CB","school":"Tennessee","height":"6'0\"","weight":"193","notes":"McCoy is the best corner in this class but he missed the entire season with an ACL tear. His 2024 tape was phenomenal however, and he has great potential."},{"pick":10,"team":"Cincinnati Bengals","player":"Arvell Reese Jr.","position":"LB","school":"Ohio State","height":"6'4\"","weight":"243","notes":"The Bengals take Reese and clearly believe in his pass rushing abilities. He started the season strong but fell off and didn't have any sacks in the last few games. This was his first season as a full time edge so his best football may be ahead of him."},{"pick":11,"team":"Miami Dolphins","player":"Mansoor Delane","position":"CB","school":"LSU","height":"6'1\"","weight":"185","notes":"Great man corner who transferred from Virginia Tech. He has good technique and locked down SEC receivers all season. Dolphins fill their biggest need."},{"pick":12,"team":"Dallas Cowboys","player":"Caleb Banks","position":"DL","school":"Florida","height":"6'6\"","weight":"325","notes":"Banks dominated in the Senior Bowl and has huge potential based on his size. He offers great pass rushing abilities for someone as big as him and is a monster in the run game."},{"pick":13,"team":"Los Angeles Rams","player":"Francis Mauigoa","position":"OT","school":"Miami","height":"6'6\"","weight":"315","notes":"My OT1. He is a mauler in the run game and doesn't allow pressures. I think he'll have no problem staying out at tackle in the NFL. Will be essential in keeping Stafford healthy this season."},{"pick":14,"team":"Baltimore Ravens","player":"Olaivavega Ioane","position":"OL","school":"Penn State","height":"6'4\"","weight":"328","notes":"The best interior lineman in the class. He moves people at will and fills a huge need for the Ravens on the offensive line. He allowed 0 sacks this past season and is a day 1 starter."},{"pick":15,"team":"Tampa Bay Buccaneers","player":"T.J. Parker","position":"DL","school":"Clemson","height":"6'3\"","weight":"260","notes":"Hoped to see a better season from Parker but I still believe in his potential as an every down player in the league. He is one of the few edges left with ability to impact run and pass."},{"pick":16,"team":"New York Jets","player":"Makai Lemon","position":"WR","school":"USC","height":"5'11\"","weight":"195","notes":"Tremendous athleticism for his size. He knows how to read defenders blind spots and get himself wide open. Similar type receiver to JSN and Amon Ra. Has great potential."},{"pick":17,"team":"Detroit Lions","player":"Cashius Howell","position":"DL","school":"Texas A&M","height":"6'2\"","weight":"248","notes":"He is a great pass rusher but that may be all he is at the next level. His size may limit his every down potential but his pass rushing traits are elite."},{"pick":18,"team":"Minnesota Vikings","player":"Peter Woods","position":"DL","school":"Clemson","height":"6'3\"","weight":"310","notes":"Woods has looked like a first rounder since he was a freshman. Has great potential but has slipped down boards after a down year. He can offer upside in both the pass and run game so the Vikings take a swing."},{"pick":19,"team":"Carolina Panthers","player":"Spencer Fano","position":"OL","school":"Utah","height":"6'5\"","weight":"305","notes":"Panthers need offensive line help and Fano is great value here. He is an immediate starter on the line and can move inside to guard if need be."},{"pick":20,"team":"Dallas Cowboys","player":"Avieon Terrell","position":"CB","school":"Clemson","height":"5'11\"","weight":"180","notes":"Undersized corner but plays super physical and great technique. Had five forced fumbles this season and it's no accident. He has mastered the peanut punch."},{"pick":21,"team":"Pittsburgh Steelers","player":"Kadyn Proctor","position":"OL","school":"Alabama","height":"6'7\"","weight":"366","notes":"Proctor has huge upside if he can play true to his size. At 6'7 Proctor can really be a problem for defenders. I'd like to see him play stronger and set a strong base in pass pro."},{"pick":22,"team":"Los Angeles Chargers","player":"Kayden McDonald","position":"DL","school":"Ohio State","height":"6'3\"","weight":"326","notes":"McDonald offers help in the run department as he easily handles his gaps even on double teams. Needs to work on his pass rush ability but a good fit with the Chargers."},{"pick":23,"team":"Philadelphia Eagles","player":"Kenyon Sadiq","position":"TE","school":"Oregon","height":"6'3\"","weight":"245","notes":"The Eagles add another weapon to their offense and can have an heir to Dallas Goedert. Sadiq is a good route runner and can block at the second level. I'm not sure how much I believe in him as an in-line tight end but we will see."},{"pick":24,"team":"Cleveland Browns","player":"Monroe Freeling","position":"OL","school":"Georgia","height":"6'7\"","weight":"315","notes":"Freeling has a limited sample size of starts in college but showed real promise this season. He has true tackle size and has been slowly creeping up boards all off-season. At 6'7 Freeling is a great start to rebuilding the Browns offensive line."},{"pick":25,"team":"Chicago Bears","player":"Keldric Faulk","position":"DL","school":"Auburn","height":"6'6\"","weight":"285","notes":"Faulk has the ideal frame you want in an NFL edge defender. The problem is he didn't produce sacks this season. He is strong in the run game and has the size + speed he needs to develop into a plus pass rusher."},{"pick":26,"team":"Buffalo Bills","player":"Denzel Boston","position":"WR","school":"Washington","height":"6'4\"","weight":"210","notes":"The Bills add a much needed weapon for Josh Allen. Boston is a big body receiver who gives them a go up and get it element to the Bills offense."},{"pick":27,"team":"San Francisco 49ers","player":"Emmanuel McNeil-Warren","position":"S","school":"Toledo","height":"6'3\"","weight":"209","notes":"The Niners follow the new trend of big and versatile safeties. EMW plays all over the field and plays mean. He hits hard and causes turnovers all over the field. Played at Toledo so competition is questionable."},{"pick":28,"team":"Houston Texans","player":"Caleb Lomu","position":"OL","school":"Utah","height":"6'6\"","weight":"308","notes":"The Texans need help on the offensive line and Lomu is the best guy on the board. He is great in pass pro and will be a huge help in protecting Stroud."},{"pick":29,"team":"Los Angeles Rams","player":"Brandon Cisse","position":"CB","school":"South Carolina","height":"6'0\"","weight":"190","notes":"Cisse is expected to put up stud numbers at the combine. He is super fluid and can run with anybody. Big upgrade for the Rams."},{"pick":30,"team":"Denver Broncos","player":"CJ Allen","position":"LB","school":"Georgia","height":"6'1\"","weight":"235","notes":"Allen is a great tackler and led an NFL style defense at Georgia. Super run defender but could work on his coverage. Should have no problem transitioning to the league."},{"pick":31,"team":"New England Patriots","player":"Omar Cooper Jr.","position":"WR","school":"Indiana","height":"6'0\"","weight":"204","notes":"Cooper was a stud at Indiana this year and instrumental to their success with 13 receiving touchdowns. He is super smooth in his routes and amazing after the catch. Gives Drake Maye a big time weapon."},{"pick":32,"team":"Seattle Seahawks","player":"Akheem Mesidor","position":"DL","school":"Miami","height":"6'3\"","weight":"265","notes":"Mesidor has great tools and can play both run and pass. His issue is age. He will be a 25 year old rookie next season but will be an instant impact player and will help Seattle look to repeat."}]}
